#language: ru

@tree

Функционал: Создание документов и отчетов для дипломной работы

Как Студент я хочу
Автоматизировать процесс проверки создания документов и отчетов от имени разных пользователей 
чтобы сократить время на ручное регрессионное тестирование и оперативно обнаруживать ошибки в данном процессе

Сценарий: Я проверяю корректность создания документов с номером и отчетов


И Я проверяю корректность создания документа Обслуживание клиента	
И Я проверяю корректность редактирования документа Обслуживание клиента
И Я проверяю корректность массового создания документов Реализация товаров и услуг
И Я проверяю корректность создания и сравнения отчета Анализ выставленных актов
