#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыставленныеКОплатеРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора.Ссылка КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ПО ВКМ_ОбслуживаниеКлиента.Ссылка = ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Дата >= ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора
	|	И ВКМ_ОбслуживаниеКлиента.Дата <= ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|	И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = &ВидДоговора
	|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	Запрос.Параметры.Вставить("ВидДоговора", ВидДоговора);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ = Истина;
	Иначе 
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Договор = Договор;
		Если ЗначениеЗаполнено(ВыполненныеРаботы) Тогда
			Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
			Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
		Иначе
			Движение.КоличествоЧасов = 0;
			Движение.СуммаКОплате = 0;
		КонецЕсли;
		Если ВыставитьКОплате Тогда
			ДвижениеВыставленныеКОплате = Движения.ВКМ_ВыставленныеКОплатеРаботы.Добавить();
			ДвижениеВыставленныеКОплате.Период = Дата;
			ДвижениеВыставленныеКОплате.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			ДвижениеВыставленныеКОплате.Договор = Договор;
			Если ЗначениеЗаполнено(ВыполненныеРаботы) Тогда
				ДвижениеВыставленныеКОплате.КоличествоЧасов = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
				ДвижениеВыставленныеКОплате.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
			Иначе
				ДвижениеВыставленныеКОплате.КоличествоЧасов = 0;
				ДвижениеВыставленныеКОплате.СуммаКОплате = 0;
			КонецЕсли; 
		КонецЕсли;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиента.ОбщееКоличествоЧасовКОплате КАК ЧасыКОплатеКлиенту
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ПроцентОтРабот) Тогда
			Отказ = Истина;
		ИначеЕсли Число(Выборка.ПроцентОтРабот) >= 0 Тогда
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Специалист;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы * Число(Выборка.ПроцентОтРабот) / 100; 
			Движение.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту; 
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
	ОбщееКоличествоЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	
	СправочникЭлементТекст = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Номер КАК Номер,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СправочникЭлементТекст = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент(); 
		ДатаДокумента = Формат(ВыборкаДетальныеЗаписи.Дата,"ДЛФ=D");
		СпециалистДокумента = ВыборкаДетальныеЗаписи.Специалист;
		ВремяДокумента = Формат(ВыборкаДетальныеЗаписи.Дата,"ДЛФ=T");
		ДатаДокументаОбъект = Формат(Дата,"ДЛФ=D");
		СпециалистДокументаОбъект = Специалист;
		ВремяДокументаОбъект = Формат(Дата,"ДЛФ=T");
		
		Если ДатаДокумента <> ДатаДокументаОбъект Тогда
			ТекстДата = СтрШаблон("Дата %1 документа %2 изменена", Дата, ВыборкаДетальныеЗаписи.Номер) ;
			СправочникЭлементТекст.Текст = ТекстДата; 
		КонецЕсли;	
		Если
			СпециалистДокумента <> СпециалистДокументаОбъект Тогда
			ТекстСпециалист = СтрШаблон("В документе %1 назначен другой специалист %2", ВыборкаДетальныеЗаписи.Номер, Специалист);
			СправочникЭлементТекст.Текст = ТекстСпециалист;
		КонецЕсли;
		Если ВремяДокумента <> ВремяДокументаОбъект Тогда
			ТекстВремя = СтрШаблон("Время документа %1 изменено", ВыборкаДетальныеЗаписи.Номер);
			СправочникЭлементТекст.Текст = ТекстВремя;
		КонецЕсли;
		
		СправочникЭлементТекст.Записать();
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Ссылка)Тогда
		Текст = СтрШаблон("Создан новый документ, назначен специалист %1", Специалист);
		СправочникЭлементТекст.Текст = Текст;
		СправочникЭлементТекст.Записать();
	КонецЕсли;
					
КонецПроцедуры

#КонецОбласти

#КонецЕсли
