Функция ВыполнитьМассовоеСозданиеАктов(СтруктураПериодМассивАктов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя,
	|	РеализацияТоваровУслуг.Ссылка КАК СсылкаРеализация,
	|	ЗаказПокупателя.Дата КАК Дата
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО (РеализацияТоваровУслуг.Основание = ЗаказПокупателя.Ссылка)
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ЗаказПокупателя.Договор
	|			И (МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(ЗаказПокупателя.Дата))
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", СтруктураПериодМассивАктов.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПериодМассивАктов.Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыборка = РезультатЗапроса.Выгрузить();
	Возврат ТЗВыборка;

КонецФункции
