#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
  
  Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	  
	  Для Каждого Строка Из СписокСотрудников Цикл 
		  
		  Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		  Движение.ВидРасчета = Строка.ВидРасчета;
		  Движение.Сторно = Ложь;
		  Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		  Движение.ПериодДействияКонец = КонецМесяца(Дата);
		  Движение.ПериодРегистрации = Дата;
		  Движение.Сотрудник = Строка.Сотрудник;
		  Движение.Подразделение = Строка.Подразделение;
		  Движение.СуммаПремии = Строка.СуммаПремии;
		  Движение.НДФЛ = Движение.СуммаПремии * 13 / 100;
		  
		  ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		  ДвижениеУдержание.ПериодРегистрации = Дата;
		  ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		  ДвижениеУдержание.Сторно = Ложь;
		  ДвижениеУдержание.ПериодДействияНачало = НачалоМесяца(Дата);
		  ДвижениеУдержание.ПериодДействияКонец = КонецМесяца(Дата);
		  ДвижениеУдержание.Сотрудник = Строка.Сотрудник;
		  ДвижениеУдержание.Подразделение = Строка.Подразделение;
		  ДвижениеУдержание.НДФЛ = Движение.НДФЛ; 
		  
		  ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		  ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
		  ДвижениеВзаиморасчеты.Период = Дата;
		  
		 		  
	  КонецЦикла;
	  
	  Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	  Движения.ВКМ_Удержания.Записать();
	  Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	  
	  ВзаиморасчетыССотрудниками();
    	  
  КонецПроцедуры 
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции 
 
  Процедура ВзаиморасчетыССотрудниками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.СуммаПремии, 0)) КАК СуммаПремии,
		|	СУММА(ЕСТЬNULL(ВКМ_Удержания.НДФЛ, 0)) КАК НДФЛ,
		|	ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК ВКМ_ВзаиморасчетыССотрудниками
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки = ВКМ_Удержания.НомерСтроки
		|		И ВКМ_ВзаиморасчетыССотрудниками.Регистратор = ВКМ_Удержания.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки = ВКМ_ДополнительныеНачисления.НомерСтроки
		|		И ВКМ_ВзаиморасчетыССотрудниками.Регистратор = ВКМ_ДополнительныеНачисления.Регистратор
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудниками.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками[Выборка.НомерСтроки - 1];
		Движение.Сумма = Выборка.СуммаПремии - Выборка.НДФЛ; 
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли