#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИзДокумента = Параметры.АдресДокумента;
	
	Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(АдресИзДокумента));
	
	Объект.Год = Параметры.Год;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДиаграмму(Команда)
	
	ДиграммаОтпусков.Обновление = Ложь;
	
	ДиграммаОтпусков.Очистить();
	
	Для каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		Точка = ДиграммаОтпусков.УстановитьТочку(Строка.Сотрудник); 
		Серия = ДиграммаОтпусков.УстановитьСерию("Отпуск");
		
		Значение = ДиграммаОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();		
		Интервал.Начало = Строка.ДатаНачала;		
		Интервал.Конец = Строка.ДатаОкончания; 
		
		ДиграммаОтпусков.Обновление = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти