#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_КоличествоДнейОтпуска.Записывать = Истина;
	
	Для каждого Строка Из ОтпускаСотрудников Цикл
	
		Движение = Движения.ВКМ_КоличествоДнейОтпуска.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Период = Дата;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
		
		РазницаДней = ((НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24)); 

		Движение.КоличествоДнейОтпуска = РазницаДней;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли