#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительнаяОперация = ЗаполнитьНаСервере();
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()
	
	СтруктураПериодМассивАктов = Новый Структура;
	СтруктураПериодМассивАктов.Вставить("Период", Объект.Период); 
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьМассовоеСозданиеАктов", СтруктураПериодМассивАктов);
	
	ТЗВыборка = Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьМассовоеСозданиеАктов(СтруктураПериодМассивАктов);
	Для каждого Строка Из ТЗВыборка Цикл
		СтрокаТЧ = Объект.Договоры.Добавить();
		СтрокаТЧ.ДоговорКонтрагента = Строка.Договор;
		СтрокаТЧ.РеализацияПоДоговору = Строка.СсылкаРеализация;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.РеализацияПоДоговору) Тогда
			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НоваяРеализация.Дата = ТекущаяДата();
			НоваяРеализация.Договор = Строка.Договор;
			НоваяРеализация.Заполнить(Строка.ЗаказПокупателя);
			НоваяРеализация.ВыполнитьАвтозаполнение();
			НоваяРеализация.ПроверитьЗаполнение();
			НоваяРеализация.Записать();
			СтрокаТЧ.РеализацияПоДоговору = НоваяРеализация.Ссылка;
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ДлительнаяОперация;
	
КонецФункции 

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка завершена.";
		Сообщение.Сообщить();
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

